Revit 2027 API
WallSweepInfo.WallSweepType Property
 The type (either a wall sweep or a reveal).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public WallSweepType WallSweepType { get; set; }
Public Property WallSweepType As WallSweepType
	Get
	Set
public:
property WallSweepType WallSweepType {
	WallSweepType get ();
	void set (WallSweepType value);
}
member WallSweepType : WallSweepType with get, set
Property Value
WallSweepType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
WallSweepInfo Class
Autodesk.Revit.DB Namespace